What advice would y'all give to a new Reddit User?
Girl Flowers and dancing, David Dubnitskiy, Photography, 2015
Friends' star Lisa Kudrow responds to criticisms of show's 'all-white cast,' saying sitcom 'should be looked at as a time capsule, not for what they did wrong'
Coal industry will never recover after coronavirus pandemic, experts say
The Prime Minister of Belgium visited a hospital and was greeted like this
I needed to see why my AC wasn't kicking on. I guess I'll wait.
In movies, there are two kinds of vents. Human sized vents and vents that are big enough only for the smallest, least experienced member of the group.
Thoughts?
The NRA has sure been silent about Kenneth Walker, a legal gun owner who has now been charged with attempted murder for shooting at plainclothes police who burst into his house in the middle of the night, during a no-knock raid at the wrong house, in which the police killed his girlfriend.
Found this Covid conspiracy poster on a walk today
TIL Carl Weathers was a retired NFL linebacker who had only done minor acting roles when he auditioned for the part of Apollo Creed in Rocky. He got the role because during the audition, he said Sylvester Stallone wasn't a "real actor" and Stallone thought it was something Creed would say.
This is accurate from what I’ve read
I am a doctor and 4.5 years ago, I was sexually assaulted in the hospital by another doctor. I was retaliated against by USC and leaders of Los Angeles County+USC Medical Center. This week, the medical board of CA, revoked the rapist’s license.
So close...wait
Eric Trump says coronavirus will 'magically go away' after election, suggesting disease is a Democrat ploy
My ex gf named Karen, who is a black belt in karate, got wasted with her 2 friends last Saturday night. She hit me in the head with a frying pan and the 3 of them assaulted me. She was arrested and given a felony. Now she's on social media playing the victim.
He has a point
Trump's just jealous
My girlfriend incorrectly perceived a slight against her, and sabotaged our relationship.
Elderly lady showing us a trick
Carrot Bacon
Little pink minivan record player
TIL that 'Idiot' once specifically referred to somebody with the mental age of a 2yr old. 'Imbecile' referred to somebody with the mental age of a 3 to 7yr old, and 'Moron' referred to somebody with the mental age of a 7 to 10yr old.
Man, those pesky hackers evolve more and more every day
Good Pupper Being Brushed
Sex Shop and Sex Workers of Reddit: What are some of the best examples or clients not knowing how anatomy/sex works?
https://www.reddit.com/r/AskReddit/comments/glugf8/sex_shop_and_sex_workers_of_reddit_what_are_some/
Bumblebee_doodles
Trump Calls Legally Protected Whistleblowing a 'Racket' as Fired Scientist Rips President's Failed Covid-19 Response
https://www.commondreams.org/news/2020/05/18/trump-calls-legally-protected-whistleblowing-racket-fired-scientist-rips-presidents
Innocul8
every time
https://i.redd.it/mhagqgsuthz41.jpg
auliatepe
Almost 90,000 dead and no hint of national mourning. Are these deaths not ‘ours’?
https://www.washingtonpost.com/outlook/national-mourning-coronavirus/2020/05/15/b47fc670-9577-11ea-82b4-c8db161ff6e5_story.html
marji80
DMT-induced entity encounter experiences have many similarities to non-drug entity encounter experiences such as those described in religious, alien abduction, and near-death contexts. Aspects of the experience and its interpretation produced profound and enduring ontological changes in worldview.
https://journals.sagepub.com/doi/full/10.1177/0269881120916143
-AMARYANA-
Obama reminds us what a US president should sound like
https://edition.cnn.com/2020/05/17/opinions/obama-what-a-president-should-sound-like-obeidallah/index.html
Jinno69
Ardern becomes New Zealand's most popular PM in a century: poll
https://www.reuters.com/article/us-newzealand-politics-poll/ardern-becomes-new-zealands-most-popular-pm-in-a-century-poll-idUSKBN22U0PI
O_1_O
'Delusional' Martin Shkreli denied prison release by judge
https://www.sfgate.com/news/article/Delusional-Martin-Shkreli-denied-prison-release-15276049.php
LurkmasterGeneral
Oxford SARS-CoV2 vaccine to be made available to 30 million Brits by September, if trials succeed
https://news.sky.com/story/coronavirus-covid-19-vaccine-for-30-million-by-september-if-trial-succeeds-says-sharma-11990039
pwrd
Taliban rocket stopped by C-RAM
https://v.redd.it/8s43aawj3fz41
DomMedbery11
What's up with Elon Musk's recent tweet "take the red pill"?
https://www.reddit.com/r/OutOfTheLoop/comments/glnf5o/whats_up_with_elon_musks_recent_tweet_take_the/
drphilisturning69
I am one with nature
https://i.redd.it/grjvj9tglhz41.jpg
Max_Stoned
What is something that seems normal to others but pisses you off?
https://www.reddit.com/r/AskMen/comments/glpls9/what_is_something_that_seems_normal_to_others_but/
MintieMask
Mini Messi sculpture creation!
https://v.redd.it/3h6l376eqhz41
MTPROJECTS
Guy is asked to make a video of the flat he's being forced out of...
https://twitter.com/sandybatchelor/status/1262038309456547840
hennell
Cliché topic but I was going to propose today, we broke up on the 12th.
https://i.redd.it/3wlfwq20fez41.jpg
AnglerfishMiho
A few days ago in my home town
https://i.redd.it/57anuremihz41.jpg
bananaman_420
Did not know Jimmy Carter did this
https://i.redd.it/anq6dzs3tfz41.jpg
one_loop
Karen doesn't see the need for fact checking
https://i.redd.it/vyafmqi68hz41.jpg
beerbellybegone
2meirl4meirl
https://preview.redd.it/hsgp8jb1x6s21.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=944be7be0c362274d3e59883306e091521df9f59
Polyfoldprizeworthy
uhhhh.. yeaahh boneless.....
https://i.redd.it/td5mb1p63iz41.jpg
kishiki18_91
TIL the USSR tried to blackmail a gay US journalist with photos of him having sex with a Soviet spy, but he refused to cooperate and reported the incident to the CIA. When the Soviets sent the photos to prominent journalists, they all refused to out him.
https://en.wikipedia.org/wiki/Joseph_Alsop#Sexuality
bobthebonobo
I've been patient, I've redownloaded the game 7 times. I've reformated my Xbox One X. I've been playing in this state for 68 days.I'm going to call Microsoft for a refund if they or IW don't give me a solution. I've had it. I shouldn't have to use a spare console (PS4) to play a game I own. DONE
https://v.redd.it/bk0336pgdez41
melloman500
The sad fucking truth
https://i.redd.it/yqkv4c032fz41.jpg
AlejoMSP
He underestimated our power
https://i.redd.it/zy6uhd1sahz41.gif
WeakWrecker
